In [29]:
import numpy as np
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, StandardScaler
from sklearn.neural_network import MLPClassifier
from sklearn import svm
from sklearn import tree
from sklearn.metrics import accuracy_score
import pandas as pd
train=pd.read_csv('train.csv')
test=pd.read_csv('test.csv')
upload=pd.read_csv('upload.csv')
train.head()
print(train.keys())
print(train.shape)

Index(['RowNumber', 'CustomerId', 'Surname', 'CreditScore', 'Geography',
       'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Exited'],
      dtype='object')
(8000, 14)

In [30]:
#data information
print(train.info())
print(test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8000 entries, 0 to 7999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        8000 non-null   int64
 1   CustomerId       8000 non-null   int64
 2   Surname          8000 non-null   object
 3   CreditScore      8000 non-null   int64
 4   Geography        8000 non-null   object
 5   Gender           8000 non-null   object
 6   Age              8000 non-null   int64
 7   Tenure           8000 non-null   int64
 8   Balance          8000 non-null   float64
 9   NumOfProducts    8000 non-null   int64
 10  HasCrCard        8000 non-null   int64
 11  IsActiveMember   8000 non-null   int64
 12  EstimatedSalary  8000 non-null   float64
 13  Exited           8000 non-null   int64
dtypes: float64(2), int64(9), object(3)
memory usage: 875.1+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RowNumber        2000 non-null   int64
 1   CustomerId       2000 non-null   int64
 2   Surname          2000 non-null   object
 3   CreditScore      2000 non-null   int64
 4   Geography        2000 non-null   object
 5   Gender           2000 non-null   object
 6   Age              2000 non-null   int64
 7   Tenure           2000 non-null   int64
 8   Balance          2000 non-null   float64
 9   NumOfProducts    2000 non-null   int64
 10  HasCrCard        2000 non-null   int64
 11  IsActiveMember   2000 non-null   int64
 12  EstimatedSalary  2000 non-null   float64
dtypes: float64(2), int64(8), object(3)
memory usage: 203.2+ KB
None

ONE HOT
=====

In [31]:
# One-Hot encoding 
list_cat = ['Geography', 'Gender']
train_onehot = pd.get_dummies(train, columns = list_cat, prefix = list_cat)
test_onehot=pd.get_dummies(test,columns=list_cat,prefix=list_cat)
display(test_onehot.head())
display(train_onehot.head())

,RowNumber,CustomerId,Surname,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,2209,15623595,Scott,726,39,3,62397.41,1,0,0,106139.31,1,0,0,1,0
1,9924,15740283,Yegorova,661,42,3,130339.64,1,1,0,125776.38,1,0,0,0,1
2,4617,15802368,Tan,545,34,6,62397.41,2,1,1,78372.28,1,0,0,0,1
3,6077,15615322,Anayochukwu,731,42,3,86717.08,1,1,0,136026.27,0,0,1,1,0
4,9240,15766374,Glover,533,50,6,62397.41,1,1,1,135205.58,1,0,0,1,0

,RowNumber,CustomerId,Surname,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,551,15806307,Trevisano,720,38,5,114051.97,2,0,1,107577.29,0,0,0,1,0,1
1,6897,15709621,Martin,682,54,4,62397.41,1,1,0,113088.60,1,1,0,0,1,0
2,4588,15619340,Palmer,672,31,5,119903.67,1,1,1,132925.17,0,1,0,0,1,0
3,291,15620746,Napolitani,592,40,4,104257.86,1,1,0,110857.33,0,0,0,1,1,0
4,1673,15646372,Yao,753,42,5,120387.73,1,0,1,126378.57,0,0,0,1,0,1

刪掉無關值
=====

In [32]:
#刪掉無關值
train_set = train_onehot.drop(columns=['RowNumber', 'CustomerId', 'Surname'])
test_set=test_onehot.drop(columns=['RowNumber', 'CustomerId', 'Surname'])
display(train_set.head())
display(test_set.head())

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,720,38,5,114051.97,2,0,1,107577.29,0,0,0,1,0,1
1,682,54,4,62397.41,1,1,0,113088.60,1,1,0,0,1,0
2,672,31,5,119903.67,1,1,1,132925.17,0,1,0,0,1,0
3,592,40,4,104257.86,1,1,0,110857.33,0,0,0,1,1,0
4,753,42,5,120387.73,1,0,1,126378.57,0,0,0,1,0,1

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,726,39,3,62397.41,1,0,0,106139.31,1,0,0,1,0
1,661,42,3,130339.64,1,1,0,125776.38,1,0,0,0,1
2,545,34,6,62397.41,2,1,1,78372.28,1,0,0,0,1
3,731,42,3,86717.08,1,1,0,136026.27,0,0,1,1,0
4,533,50,6,62397.41,1,1,1,135205.58,1,0,0,1,0

In [33]:
features=list(train_set.drop(columns=['Exited']))
target='Exited'
display(features)

['CreditScore',
 'Age',
 'Tenure',
 'Balance',
 'NumOfProducts',
 'HasCrCard',
 'IsActiveMember',
 'EstimatedSalary',
 'Geography_France',
 'Geography_Germany',
 'Geography_Spain',
 'Gender_Female',
 'Gender_Male']

標準化
=========

In [34]:
sc=StandardScaler()

#標準化
train_set[features]=sc.fit_transform(train_set[features])
display(train_set)

#標準化
test_set[features]=sc.transform(test_set[features])
display(test_set)

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,1.509906,-0.663721,0.339933,0.428978,0.799546,-1.537586,0.966801,0.304927,0,-1.001501,-0.580814,1.746019,-0.911178,0.911178
1,0.866637,1.465241,-0.445812,-1.214512,-0.917139,0.650370,-1.034339,0.529787,1,0.998501,-0.580814,-0.572731,1.097481,-1.097481
2,0.697356,-1.595141,0.339933,0.615161,-0.917139,0.650370,0.966801,1.339115,0,0.998501,-0.580814,-0.572731,1.097481,-1.097481
3,-0.656894,-0.397600,-0.445812,0.117359,-0.917139,0.650370,-1.034339,0.438752,0,-1.001501,-0.580814,1.746019,1.097481,-1.097481
4,2.068534,-0.131480,0.339933,0.630562,-0.917139,-1.537586,0.966801,1.072015,0,-1.001501,-0.580814,1.746019,-0.911178,0.911178
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7995,-1.063169,-1.062901,1.125677,0.652575,0.799546,0.650370,0.966801,1.011302,1,0.998501,-0.580814,-0.572731,1.097481,-1.097481
7996,-0.487612,0.267700,1.911421,1.440568,-0.917139,0.650370,-1.034339,-0.033763,0,-1.001501,1.721720,-0.572731,1.097481,-1.097481
7997,0.815853,0.001580,0.339933,1.025801,-0.917139,0.650370,-1.034339,1.251627,1,-1.001501,-0.580814,1.746019,1.097481,-1.097481
7998,1.425266,-0.663721,-0.445812,0.577801,-0.917139,-1.537586,-1.034339,-0.188456,0,0.998501,-0.580814,-0.572731,-0.911178,0.911178
7999,-0.521469,-0.131480,0.339933,-1.214512,-0.917139,-1.537586,-1.034339,-1.378566,0,0.998501,-0.580814,-0.572731,1.097481,-1.097481

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Geography_France,Geography_Germany,Geography_Spain,Gender_Female,Gender_Male
0,1.611475,-0.530660,-1.231556,-1.214512,-0.917139,-1.537586,-1.034339,0.246258,0.998501,-0.580814,-0.572731,1.097481,-1.097481
1,0.511147,-0.131480,-1.231556,0.947201,-0.917139,0.650370,-1.034339,1.047446,0.998501,-0.580814,-0.572731,-0.911178,0.911178
2,-1.452516,-1.195961,1.125677,-1.214512,0.799546,0.650370,0.966801,-0.886631,0.998501,-0.580814,-0.572731,-0.911178,0.911178
3,1.696115,-0.131480,-1.231556,-0.440735,-0.917139,0.650370,-1.034339,1.465639,-1.001501,-0.580814,1.746019,1.097481,-1.097481
4,-1.655653,0.933001,1.125677,-1.214512,-0.917139,0.650370,0.966801,1.432155,0.998501,-0.580814,-0.572731,1.097481,-1.097481
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,-0.047481,-1.062901,1.125677,-1.214512,0.799546,0.650370,0.966801,-0.159220,0.998501,-0.580814,-0.572731,-0.911178,0.911178
1996,0.138728,-0.264540,0.339933,-0.076837,0.799546,0.650370,-1.034339,0.384664,-1.001501,1.721720,-0.572731,-0.911178,0.911178
1997,-1.401731,0.400760,-1.231556,0.588901,0.799546,0.650370,0.966801,0.678179,0.998501,-0.580814,-0.572731,1.097481,-1.097481
1998,-0.487612,0.134640,1.911421,-1.214512,0.799546,0.650370,0.966801,1.143716,-1.001501,-0.580814,1.746019,1.097481,-1.097481
1999,-0.267547,-1.462081,0.339933,0.159119,-0.917139,0.650370,-1.034339,0.164698,-1.001501,1.721720,-0.572731,1.097481,-1.097481

MLP
=====

In [35]:
#MLP
mlp=MLPClassifier()
mlp_=mlp.fit(train_set[features],train_set[target])
predict_mlp=mlp_.predict(test_set[features])
predict_mlp

C:\Users\user\anaconda3\lib\site-packages\sklearn\neural_network\_multilayer_perceptron.py:582: ConvergenceWarning: Stochastic Optimizer: Maximum iterations (200) reached and the optimization hasn't converged yet.
  warnings.warn(

array([0, 0, 0, ..., 0, 0, 0], dtype=int64)

In [8]:
#upload
upload_mlp=upload
upload_mlp['Exited']=predict_mlp
upload_mlp.to_csv('upload__mlp2.csv')

Decision tree
=======

In [9]:
#decision_tree
clf = tree.DecisionTreeRegressor()
clf = clf.fit(train_set[features],train_set[target])
tree=clf.predict(test_set[features])

In [10]:
#upload
upload_tree=upload
upload_tree['Excited']=tree
upload_tree.to_csv('upload_tree.csv')

嘗試把train 分割成train 與 test
==========

In [36]:
from sklearn.model_selection import train_test_split, GridSearchCV
train, test = train_test_split(train, test_size = 0.2, random_state = 1)
display(train)
display(test)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
6375,2725,15670066,Atkinson,612,France,Male,31,2,62397.41,1,1,0,71362.46,0
255,4302,15705512,Davison,551,Spain,Female,39,5,97947.38,1,1,1,66117.60,1
5670,6038,15772632,Yermakova,614,France,Male,72,4,62397.41,1,1,1,85472.25,0
1882,9101,15682773,Akobundu,636,Germany,Male,37,3,104837.64,2,1,1,83214.03,0
5946,3446,15808283,McKay,681,Spain,Female,37,2,104274.31,1,0,0,82059.83,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7935,1266,15586479,Morrison,587,Germany,Male,45,2,134967.06,1,1,1,67074.82,1
5192,7725,15681026,Genovese,557,France,Male,47,4,62397.41,2,1,1,72138.79,0
3980,3109,15754874,Zetticci,550,France,Male,39,5,62397.41,1,1,0,86610.04,0
235,4906,15643967,Thompson,644,France,Male,49,3,62397.41,2,0,0,103723.68,0
5157,4030,15645600,Padovano,650,France,Female,40,5,156651.73,2,1,1,73651.04,0

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
4740,5129,15622461,Lockett,718,Spain,Female,35,5,62397.41,2,0,1,94350.79,0
5606,1267,15766137,Saunders,694,Germany,Female,43,4,143197.31,1,1,1,67779.60,0
4824,3179,15756894,Anayolisa,707,Spain,Male,39,3,62397.41,2,1,1,132680.30,0
4205,8621,15728823,Longo,524,France,Male,49,6,135225.53,1,1,0,83566.38,1
3228,482,15751943,Trevisano,604,France,Female,37,3,113926.68,1,1,1,128377.39,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4607,1226,15779492,Archambault,668,France,Female,37,5,62397.41,2,1,0,129881.61,0
3474,9039,15610226,Fedorova,566,Spain,Female,43,5,62397.41,1,0,0,73835.58,1
7990,7829,15603378,Ts'ao,631,France,Male,35,7,102386.36,1,1,1,89247.35,0
674,8581,15748882,Venables,568,Spain,Male,47,6,62397.41,1,1,0,64735.09,0
6012,3468,15742238,Ts'ao,666,Germany,Female,32,4,98300.21,1,1,0,101572.04,0

In [37]:
train_ = train_onehot.drop(columns=['RowNumber', 'CustomerId', 'Surname','Geography_France','Geography_Spain','Geography_Germany'])
test_=test_onehot.drop(columns=['RowNumber', 'CustomerId', 'Surname','Geography_France','Geography_Spain','Geography_Germany'])
display(train_.head())
display(test_.head())

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_Female,Gender_Male
0,720,38,5,114051.97,2,0,1,107577.29,0,0,1
1,682,54,4,62397.41,1,1,0,113088.60,1,1,0
2,672,31,5,119903.67,1,1,1,132925.17,0,1,0
3,592,40,4,104257.86,1,1,0,110857.33,0,1,0
4,753,42,5,120387.73,1,0,1,126378.57,0,0,1

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Gender_Female,Gender_Male
0,726,39,3,62397.41,1,0,0,106139.31,1,0
1,661,42,3,130339.64,1,1,0,125776.38,0,1
2,545,34,6,62397.41,2,1,1,78372.28,0,1
3,731,42,3,86717.08,1,1,0,136026.27,1,0
4,533,50,6,62397.41,1,1,1,135205.58,1,0

In [38]:
features=list(train_.drop(columns=['Exited']))
target='Exited'
display(features)

['CreditScore',
 'Age',
 'Tenure',
 'Balance',
 'NumOfProducts',
 'HasCrCard',
 'IsActiveMember',
 'EstimatedSalary',
 'Gender_Female',
 'Gender_Male']

In [39]:
sc=StandardScaler()

#標準化
train_[features]=sc.fit_transform(train_[features])
display(train_)

#標準化
test_[features]=sc.transform(test_[features])
display(test_)

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_Female,Gender_Male
0,1.509906,-0.663721,0.339933,0.428978,0.799546,-1.537586,0.966801,0.304927,0,-0.911178,0.911178
1,0.866637,1.465241,-0.445812,-1.214512,-0.917139,0.650370,-1.034339,0.529787,1,1.097481,-1.097481
2,0.697356,-1.595141,0.339933,0.615161,-0.917139,0.650370,0.966801,1.339115,0,1.097481,-1.097481
3,-0.656894,-0.397600,-0.445812,0.117359,-0.917139,0.650370,-1.034339,0.438752,0,1.097481,-1.097481
4,2.068534,-0.131480,0.339933,0.630562,-0.917139,-1.537586,0.966801,1.072015,0,-0.911178,0.911178
...,...,...,...,...,...,...,...,...,...,...,...
7995,-1.063169,-1.062901,1.125677,0.652575,0.799546,0.650370,0.966801,1.011302,1,1.097481,-1.097481
7996,-0.487612,0.267700,1.911421,1.440568,-0.917139,0.650370,-1.034339,-0.033763,0,1.097481,-1.097481
7997,0.815853,0.001580,0.339933,1.025801,-0.917139,0.650370,-1.034339,1.251627,1,1.097481,-1.097481
7998,1.425266,-0.663721,-0.445812,0.577801,-0.917139,-1.537586,-1.034339,-0.188456,0,-0.911178,0.911178
7999,-0.521469,-0.131480,0.339933,-1.214512,-0.917139,-1.537586,-1.034339,-1.378566,0,1.097481,-1.097481

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Gender_Female,Gender_Male
0,1.611475,-0.530660,-1.231556,-1.214512,-0.917139,-1.537586,-1.034339,0.246258,1.097481,-1.097481
1,0.511147,-0.131480,-1.231556,0.947201,-0.917139,0.650370,-1.034339,1.047446,-0.911178,0.911178
2,-1.452516,-1.195961,1.125677,-1.214512,0.799546,0.650370,0.966801,-0.886631,-0.911178,0.911178
3,1.696115,-0.131480,-1.231556,-0.440735,-0.917139,0.650370,-1.034339,1.465639,1.097481,-1.097481
4,-1.655653,0.933001,1.125677,-1.214512,-0.917139,0.650370,0.966801,1.432155,1.097481,-1.097481
...,...,...,...,...,...,...,...,...,...,...
1995,-0.047481,-1.062901,1.125677,-1.214512,0.799546,0.650370,0.966801,-0.159220,-0.911178,0.911178
1996,0.138728,-0.264540,0.339933,-0.076837,0.799546,0.650370,-1.034339,0.384664,-0.911178,0.911178
1997,-1.401731,0.400760,-1.231556,0.588901,0.799546,0.650370,0.966801,0.678179,1.097481,-1.097481
1998,-0.487612,0.134640,1.911421,-1.214512,0.799546,0.650370,0.966801,1.143716,1.097481,-1.097481
1999,-0.267547,-1.462081,0.339933,0.159119,-0.917139,0.650370,-1.034339,0.164698,1.097481,-1.097481

In [40]:
#rbf
mysvm=svm.SVC(kernel='rbf',gamma=0.05,C=0.85)
mysvm.fit(train_[features],train_[target])
predict_rbf=mysvm.predict(test_[features])
display(predict_rbf)

array([0, 0, 0, ..., 0, 0, 0], dtype=int64)

刪掉幾次變數後，沒有太大差異，加上方法突法煉鋼，效益不大
======